#include <iostream>
#include "windows.h"
using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	// Integer 9
	// Дано тризначне число. використовуючи одну операцію цільночисельного ділення, вивести першу цифру
	// даного числа (сотні).

	int num, ones;  
	cout << "Введіть тризначне число: "; // введення числа
	cin >> num;
	ones = num / 100; // отримання першої цифри сотні 
	cout << "Перша цифра сотні: " << ones << endl; // виведення результату




	// Boolean 2
	// Дано ціле число А. Перевірити істинність висловлювання "Число А є непарним".

	cout << "\n Boolean2. \n";
	int A;
	// введення данних
	cout << "A = ";
	cin >> A;
	// підрахунок
	bool is_nep = A % 2 != 0; // визначення ЛОГІЧНОЇ змінної
	// виведення результату
	cout << "A є непарним: " << boolalpha << is_nep << endl;






	// y = ... (tab.3 #30)
	cout << "\n Math.1. \n";
	const double pi = 3.141592; // визначення дійсної константи
	double x, num1, denom, cosx, sinx, logx, y; // декларація дійсних змінних

	cout << "Введіть значення х:"; // введення данних
	cin >> x;

	// розрахунок
	logx = log(abs(2 * x)) / log(3); // логарифм
	sinx = pow(abs(sin((3 * x + 15) * pi / 180)), 3); // значення синуса
	double expx = pow(3, 2 * x - 1); // 3 у степені
	cosx = (1.0 / 2.0) * cos(x); // косинус
	double sqrtx = sqrt(4 * pi + cosx); // вираз під коренем

	// об'єднання чисельника і знаменника
	num1 = logx * sinx; // чисельник
	denom = expx * sqrtx; // знаменник

	//остаточний розрахунок рівняння
	y = num1 / denom;
	cout << "Функція y = " << y << endl; // виведення результату
	return 0;

}
